WMSGIFT/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.итWMSНаборка</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.итWMSНаборка</types>
    </type>
  </attributes>
  <attributes>
    <name>итКоличествоВозвратнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/Enums/итWMSСтатусыСкладскихДокументов/итWMSСтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСтатусыСкладскихДокументов</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Распределяется</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВыполненСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

WMSGIFT/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.итWMSНаборка") Тогда
		Если ДанныеЗаполнения.СтатусДокумента =Перечисления.итWMSСтатусыСкладскихДокументов.Выполнен или
			ДанныеЗаполнения.СтатусДокумента =Перечисления.итWMSСтатусыСкладскихДокументов.ВыполненСОшибкой или
			ДанныеЗаполнения.СтатусДокумента =Перечисления.итWMSСтатусыСкладскихДокументов.Завершен  Тогда 
			ЗаполнитьНаОснованииНаборки(ДанныеЗаполнения);
		иначе
			СтандартнаяОбработка=Ложь;
			Сообщить("Документ не находится в конечном статусе");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииНаборки(ДанныеЗаполнения)
	Организация=ДанныеЗаполнения.Организация;
	Сделка=ДанныеЗаполнения.итОснование;
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
	Контрагент=ДанныеЗаполнения.Контрагент;
	Склад=ДанныеЗаполнения.Склад;
	Основание=ДанныеЗаполнения;
	итКоличествоВозвратнойТары=КоличествоSSCCВНаборке(ДанныеЗаполнения);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSНаборкаТовары.Номенклатура КАК Номенклатура,
		|	итWMSНаборкаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	итWMSНаборкаТовары.Характеристика КАК ХарактеристикаНоменклатуры,
		|	итWMSНаборкаТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	итWMSНаборкаТовары.Номенклатура.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
		|	СУММА(ВЫБОР
		|			КОГДА итWMSНаборкаТовары.ИзъятиеТовара
		|				ТОГДА итWMSНаборкаТовары.КоличествоФакт - итWMSНаборкаТовары.КоличествоИзъятия
		|			ИНАЧЕ итWMSНаборкаТовары.КоличествоФакт
		|		КОНЕЦ) КАК Количество,
		|	итWMSНаборкаТовары.Качество КАК Качество
		|ИЗ
		|	Документ.итWMSНаборка.Товары КАК итWMSНаборкаТовары
		|ГДЕ
		|	итWMSНаборкаТовары.Ссылка = &Ссылка
		|	И итWMSНаборкаТовары.ФиксацияСтроки
		|	И итWMSНаборкаТовары.СостояниеЗадачи <> ЗНАЧЕНИЕ(Перечисление.итwmsсостоянияЗадачТСД.отменена)
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSНаборкаТовары.Номенклатура,
		|	итWMSНаборкаТовары.СерияНоменклатуры,
		|	итWMSНаборкаТовары.Характеристика,
		|	итWMSНаборкаТовары.Номенклатура.ЕдиницаХраненияОстатков,
		|	итWMSНаборкаТовары.Номенклатура.ЕдиницаИзмеренияМест,
		|	итWMSНаборкаТовары.Качество
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА итWMSНаборкаТовары.ИзъятиеТовара
		|				ТОГДА итWMSНаборкаТовары.КоличествоФакт - итWMSНаборкаТовары.КоличествоИзъятия
		|			ИНАЧЕ итWMSНаборкаТовары.КоличествоФакт
		|		КОНЕЦ) > 0";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Товары.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяСтрока=Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	

КонецПроцедуры

Функция КоличествоSSCCВНаборке(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSНаборкаТовары.Ссылка КАК Ссылка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ итWMSНаборкаТовары.ИдентификаторУпаковкиПолучатель) КАК ИдентификаторУпаковкиПолучатель
		|ИЗ
		|	Документ.итWMSНаборка.Товары КАК итWMSНаборкаТовары
		|ГДЕ
		|	итWMSНаборкаТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSНаборкаТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат  ВыборкаДетальныеЗаписи.ИдентификаторУпаковкиПолучатель;
	КонецЦикла;
	
	Возврат 0;

	КонецФункции
Процедура  ПроверкаНаКоличествоОснований(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Основание = &Основание
		|	И РеализацияТоваровУслуг.Ссылка <> &Ссылка
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ=Истина;
		Сообщить("Уже имеется не помеченная на удаление реализация");
	КонецЦикла;
	


	КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.итWMSНаборка") и не ПометкаУдаления Тогда 
		ПроверкаНаКоличествоОснований(Отказ);
	КонецЕсли;
КонецПроцедуры
